Tekla Open API Reference for Tekla Structures 2025
Vector.Normalize Method
Overload List
Name | Description
Normalize()
 Normalizes the vector using the length 1.0 (the length of a unit vector).
Normalize(Double)
 Normalizes the vector using the given length.
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace